#!/usr/bin/env python3
# -*- coding: utf-8 -*-



year = ['Мышь', 'Корова', 'Тигр', 'Заяц', 'Дракон', 'Змея', 'Лошадь', 'Овца', 'Обезьяна', 'Курица', 'Собака', 'Свинья']
color = {0: 'Белый ', 1: 'Белый ', 2: 'Черный ', 3: 'Черный ', 4: 'Зеленый', 5: 'Зеленый', 6: 'Красный ', 7: 'Красный ', 8: 'Желтый ', 9: 'Желтый '}
year_new = int(input())
k = year_new % 10
yk = abs((year_new - 2020) % 12)
st = color[k]
if yk in [0, 5, 6, 7, 8, 10, 11] :
    st = st.replace('ый', 'ая').replace('ой', 'ая')
print(st + ' ' + year[yk])
